---
kind: property
id: P:Autodesk.Revit.DB.TableSectionData.FirstColumnNumber
source: html/58f3286a-7469-f7ea-c868-f440acfac056.htm
---
# Autodesk.Revit.DB.TableSectionData.FirstColumnNumber Property

The first column in this section of the table.

## Syntax (C#)
```csharp
public int FirstColumnNumber { get; }
```

## Remarks
Some table sections have column 0 as their first column while others start with column 1.